# Для тех, кто только сейчас видит этот файл, вместо 1 задачи:Дан список чисел. Создать список в который попадают числа, описывающие возрастающую последовательность и содержащие максимальное количество элементов. 
# Пример: [1, 5, 2, 3, 4, 6, 1, 7] => [1, 2, 3, 4, 6, 7]
#  [5, 2, 3, 4, 6, 1, 7] => [2, 3, 4, 6, 7] Порядок элементов менять нельзя
# 2.	Создать и заполнить файл случайными целыми значениями. Выполнить сортировку содержимого файла по возрастанию. 
# 3.	Вот вам файл с тысячей чисел. https://cloud.mail.ru/public/DQgN/LqoQzPEec
# Задача: найти триплеты и просто выводить их на экран. Триплетом называются три числа, которые в сумме дают 0. (решение будет долгим, ибо является демонстрационным при теме многопоточного программирования). 
